SETTINGS_FILE = 'user_settings.json'
STATES_FILE = 'user_states.json'
SCHEDULE_FILE='blackout_schedule.json'
DTEK_SETTINGS_FILE='dtek.cfg'
LOG_FILE = 'errors.log'
TZ = 'Europe/Kiev'
LISTENER_URL = 'http://35.192.99.228:5000/send?chat_id='
LOCAL_URL = 'http://127.0.0.1:5000/send?chat_id='
ALIVE='alive'
OFF='not reachable'
SCHEDULE_PING=1
SCHEDULE_LISTEN=1
SCHEDULE_GATHER_SCHEDULE=60
SCHEDULE_SET_NOTIFICATION=30
SCHEDULE_SEND_NOTIFICATION=3
YASNO_URL = 'https://api.yasno.com.ua/api/v1/pages/home/schedule-turn-off-electricity'
DTEK_CHANNEL_ID = '@dtek_ua'
isPostOK="F"
msg_greeting="Вітаю! Налаштуйте бот для перевірки доступності IP адреси кожну хвилину (для старту моніторингу адреса має бути доступна), або ввімкніть режим прослуховування. Є можливість публікації повідомлень у канал (для цього попередньо додайте бот в канал)"
msg_comeback="З поверненням!"
msg_error="Виникла помилка, перезапустіть бота"
msg_mainmnu="Головне меню"
msg_setip="Будь ласка, введіть IP (v4) адресу для моніторингу (за необхідності порт можна вказати через двокрапку), або знак '-' (дефіс), щоб видалити вказану раніше:"
msg_setlabel="Будь ласка введіть назву адреси для моніторингу, або знак '-' (дефіс), щоб видалити вказану раніше:"
msg_setchannel="Будь ласка введіть ID каналу для публікації (для приватних - числовий ІД), або знак '-' (дефіс), щоб видалити вказану раніше:"
msg_setcity="Є можливість підлючити графік відключень від Yasno чи ДТЕК. Наразі доступні міста:"
msg_setcitybottom="Введіть назву міста, або знак " + "'-'" + " (дефіс), щоб скасувати"
msg_setgroup="Будь ласка, введіть групу, до якої належить ваш будинок для отримання графіків відключень,\n або " + "'-'" + ", щоб скасувати"
msg_reminder_no_schedule="Для активації нагадувань необхідно підлючити графік відключень електроенергії\nНагадування спрацьовують приблизно за 15 хв. до планового відключення (не в сірій зоні).\nНагадування припиняють надсилатися, якщо останню добу відключень не було"
msg_reminder_turnon="Нагадування спрацьовуватимуть приблизно за 15 хв. до планового відключення (не в сірій зоні).\nНагадування припиняють надсилатися, якщо останню добу відключень не було"
msg_reminder_on="Нагадування ввімкнено\n"
msg_reminder_off="Нагадування вимкнено\n"
msg_telegram_news_on="Пересилання новин ввімкнено\n"
msg_telegram_news_off="Пересилання новин вимкнено\n"
msg_settings="Поточні налаштування:"
msg_noip='IP адреса не вказана. Будь ласка, використайте "Вказати IP адресу для моніторингу"'
msg_ippingon="Пінг IP адреси ввімкнено\n"
msg_ippingondetailed="Буде активовано моніторинг по IP адресі (слухача ввімкнено не буде, вимкайте слухача окремо тільки після налаштування зі своєї сторони)"
msg_ippingoff="Пінг IP адреси вимкнено\n"
msg_listeneron="Режим слухача ввімкнено\n" 
msg_listeneroff="Режим слухача вимкнено\n"
msg_boton="Публікація в бот ввімкнена\n"
msg_botoff="Публікація в бот вимкнена\n"
msg_channelon="Публікація в канал ввімкнена\n"
msg_channeloff="Публікація в канал вимкнена\n"
msg_stopped="Моніторинг зупинено"
msg_notset="Моніторинг не налаштовано"
msg_postbot="Публікація в бот ввімкнена"
msg_postchannel="Публікація в канал ввімкнена"
msg_nopostbot="Публікація в бот вимкнена"
msg_nopostchannel="Публікація в канал вимкнена"
msg_nochannel="Канал не вказано"
msg_alive="💡Електрохарчування *є*!"
msg_blackout="🔦 Немає світла!"
msg_badinput='Некоректний ввод'
msg_spotadded='Нову точку додано, налаштуйте її'

msg_listparams='Список параметрів:\nip_address(str)\nlistener(bool)\nlabel(str)\nchannel_id(str)\nto_bot(bool)\nto_channel(bool)\nhas_schedule(bool)\ncity(str)\ngroup(str)\nto_remind(bool)\nto_telegram(bool)\nendpoint(str)\nheaders(json)\nlast_state(str:["alive"|"not reachable"])\nlast_ts(datetime UTC)\nlast_heared_ts(datetime UTC)\nnext_notification_ts(datetime Kyiv)\nnext_outage_ts(datetime Kyiv)\ntom_notification_ts(datetime Kyiv)\ntom_schedule_ts(datetime Kyiv)'
msg_helplist="1 - Загальні питання\n*Головне меню*:\n2 - Отримати статус негайно\n3 - Старт\n4 - Стоп\n5 - Налаштування" +\
             "\n6 - Вказати IP\n7 - Вказати назву\n8 - Вказати канал\n9 - в бот (так/ні)\n10 - в канал (так/ні)\n11 - Пінгувати(так/ні)" +\
             "\n12 - Слухати (так/ні)\n13 - Графік\n14 - Нагадати"
msg_help = {}
msg_help['1']="Бот призначений для моніторингу наявності електроенергії\nДоступні такі способи перевірки:\n- *пінг IP адреси* (це може бути, наприклад," +\
              " зовнішня IP адреса роутера, що не підключений до ДБЖ). Варто враховувати, що при зміні IP адреси треба вчасно вносити зміни в " +\
              "налаштування\n- *перевірка доступності порту на IP адресі* (порт має бути відкритий)\n- *перевірка статусу по API*, наприклад, для" +\
              " смарт-розеток (для налаштування зверніться в підтримку, посилання в описі бота)\n- *налаштування get-викликів* на сервер (*слухач*), " +\
              "якщо виклики припиняються більше, ніж на 5хв - бот вважає, що електрика зникла\nДоступне налаштування для публікації повідомленнь " +\
              "від бота в будь-який *канал* (для цого бот має бути доданий до каналу, як адміністратор)\n*Є можливість додати графіки відключень*, тоді в " + \
              "повідомленнях будуть додатково відомості щодо відключень по графіку, а також доступні нагадування перед плановими вимкненнями і графік " +\
              "на наступний день\nНаразі доступні міста: *Київ, Дніпро, Ірпінь, Софіївська Борщагівка*. З приводу додання інших міст звертайтесь в підтримку"
msg_help['2']="*Негайно робить запит на перевірку статусу* (є чи немає електрики), залежно від налаштувань. \nУ випадку, якщо налаштовано тільки " +\
              "слухач - просто повертає поточний статус. Якщо виклик виявив, що статус змінився - повідомлення прийде як і бот, так і в канал " +\
              "(якщо його налаштовано). В іншому випадку повідомлення буде тільки в бот"
msg_help['3']="*Старт* - запускає моніторинг, якщо його було вимкнено і якщо було налаштовано пінг IP адреси, перевірка порту чи виклик API\n" +\
              "*Запуск слухача не здійснюється!* - для цього потрібно перевірити, що налаштовано регулярні виклики слухача, " +\
              "перейти в налаштування і запустити слухача окремо"
msg_help['4']="*Стоп* - зупиняє весь моніторинг, якщо його було ввімкнено, в тому числі слухача"
msg_help['5']="*Налаштування* - перехід в меню налаштувань. Також показує всі поточні налаштування (окрім API) в одному повідомленні"
msg_help['6']="*Вказати IP* - налаштування пінгу IP адреси чи перевірка порту\nЯкщо вказати тільки IP адресу (v4), без порту - буде нааштовано пінг\n" +\
              "Якщо вказати порт (через двокрапку в кінці, без пробілів) - буде налаштована перевірка доступності порту\n" +\
              "Якщо відправити знак '-' (дефіс) - поточне налаштування буде видалено"
msg_help['7']="*Вказати назву* - дозволяє вказати назву об'єкта, що моніториться. Довжина до 255 символів\n" +\
              "Якщо відправити знак '-' (дефіс) - поточне налаштування буде видалено"
msg_help['8']="*Вказати канал* - налаштування каналу для додаткової публікації повідомлень, не тільки в чат бота\n" +\
              "Для публічних каналів можна вказати посилання на канал (починється з https://t.me/), або ім'я каналу в форматі @channel_name\n" +\
              "Для закритих каналів необхідно вказати ID каналу. Для цього можна використати бот @GetChatID_IL_BOT: перешліть в цього бота " +\
              "будь-яке повідомлення з закритого каналу, і він поверне ID цього каналу (має починатися з мінусу)\n" +\
              "Якщо відправити знак '-' (дефіс) - поточне налаштування буде видалено"
msg_help['9']="*в бот (так/ні)* - вмикає чи вимикає публікацію повідомлень про зміну статусу (є чи нема електрики) та нагадування в чат бота\n" +\
              "Поточне значення - ввімкнена чи вимкнена публікація в бот - буде показано при переході в Налаштування"
msg_help['10']="*в канал (так/ні)* - вмикає чи вимикає публікацію повідомлень про зміну статусу (є чи нема електрики) та нагадування в канал\n" +\
              "Поточне значення - ввімкнена чи вимкнена публікація в канал - буде показано при переході в Налаштування"
msg_help['11']="*Пінг (так/ні)* - вмикає чи вимикає моніторинг, відповідно до налаштувань, пінгу IP адреси, перевірку порту чи виклик API\n" +\
              "Поточне значення - ввімкнено чи вимкнено пінг - буде показано при переході в Налаштування"
msg_help['12']="*Слухати (так/ні)* - вмикає чи вимикає слухача\n" +\
              "Поточне значення - ввімкнено чи вимкнено слухача - буде показано при переході в Налаштування"
msg_help['13']="*Графік* - налаштування графіку відключень, тоді в " + \
              "повідомленнях будуть додатково відомості щодо відключень по графіку, а також доступні нагадування перед плановими вимкненнями і графік " +\
              "на наступний день\nНаразі доступні міста: *Київ, Дніпро, Ірпінь, Софіївська Борщагівка*. З приводу додання інших міст звертайтесь в підтримку" +\
              "Спочатку буде показно перелік доступних міст і пропозиція вказати місто. *Важливо вказати назву міста точно як у списку*, інакше " +\
              "бот поверне помилку\n Після вибору міста, буде запрпоновано вказати групу відповідно до вашого графіку" +\
              "Якщо відправити знак '-' (дефіс) на будь-якому етапі - операцію буде скасовано"
msg_help['14']="*Нагадати* - вмикає чи вимикає нагадування. Для нагадувань має бути налаштований графік. Нагадування надсилаються приблизно " +\
              "за 15хв перед плановими вимкненнями електрики, також щовечора близько 21:00 буде приходити графік на наступний день\n" +\
              "Також бот моніторить канал ДТЕК і пересилає важливі новини щодо відключень, наприклад особливості відключень на наступний день\n" +\
              "Нагадування про відключення за графіком і графіки на наступний день припиняються, якщо відключень не було понад добу\n" +\
              "Поточне значення - ввімкнено чи вимкнено нагадування - буде показано при переході в Налаштування"
